# Load and Explore the Dataset

In [1]:
# import libraries
import pandas as pd
import numpy as np

> This dataset contais details about passengers on the Titanic. 
> The objective of this project was to perform cleaning operations like handling missing values, filtering, and data type conversions.

In [2]:
# Read dataset as d dataframe
titanic= pd.read_csv("Titanic dataset.csv")

In [3]:
# views number of rows and columns
titanic.shape

(891, 12)

In [4]:
# view top 5 rows of dataset
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# view bottom 5 rows of dataset
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
# view columns and their data types
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# view number of uniques values in columns
titanic.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [8]:
# view total number of null values in each column
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
# check for duplicates
titanic.duplicated().sum()

0

In [10]:
# check for summary statistics
titanic.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

# Data Cleaning

In [11]:
# ccalculate null percentage in each column
null_percentage = (titanic.isnull().sum()/(len(titanic))) * 100
null_percentage

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [12]:
# Drop columns with null more than 50% 
titanic = titanic.drop(columns=null_percentage[null_percentage > 50].index)

# check which columns were dropped
print("Remaining columns:", titanic.columns)

Remaining columns: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [13]:
# since the age column is numerical data, null values were fill with mean
titanic["Age"]= titanic["Age"].fillna(round(titanic["Age"].mean()))

In [14]:
# since Embarked column was categorical data, null values in this column were filled with mode
titanic["Embarked"]= titanic["Embarked"].fillna(titanic["Embarked"].mode()[0])

In [15]:
# verify if null values were imputted
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [16]:
# it look like PassengerId and Pclass are Categorical not numerical data
# convert PassengerId and Pclass to object
titanic["PassengerId"] =titanic["PassengerId"].astype(str)
titanic["Pclass"] =titanic["Pclass"].astype(str)

In [17]:
# verify if datatypes was converted
titanic.dtypes

PassengerId     object
Survived         int64
Pclass          object
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

## Feature engineering

In [19]:
# check minimum age 
titanic["Age"].min()

0.42

In [20]:
# check maximum age
titanic["Age"].max()

80.0

In [21]:
# create Age Group column from the age column

bins=[0, 12, 18, 35, 60, 81]
labels=["Child", "Teenager", "Young Adult", "Adult", "Senior"]

titanic["Age Group"]=pd.cut(titanic["Age"], bins=bins, labels=labels, right=False)

In [22]:
# Check the newly created column
titanic[["Age", "Age Group"]].head()

    Age    Age Group
0  22.0  Young Adult
1  38.0        Adult
2  26.0  Young Adult
3  35.0        Adult
4  35.0        Adult

In [23]:
# SibSp: is the number of siblings or spouses the passenger had aboard the Titanic
# Parch: is the number of parents or children the passenger had aboard the Titanic
# Create a new column SizeOfFamily based on SibSp and Parch
titanic["SizeOfFamily"] = titanic["SibSp"] + titanic["Parch"] + 1

In [24]:
# Check the newly created column
titanic[["SibSp", "Parch", "SizeOfFamily"]].head()

   SibSp  Parch  SizeOfFamily
0      1      0             2
1      1      0             2
2      0      0             1
3      1      0             2
4      0      0             1

In [25]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age Group,SizeOfFamily
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,Young Adult,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,Adult,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,Young Adult,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,Adult,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,Adult,1

In [26]:
# Create new clean csv table from the cleaned dataframe
titanic.to_csv("Titanic_cleaned.csv", index=False)